{
  "_id_structure": "1_two_digitFileSerialNumber(02)_questionType(1/2)_twoDigitQuestionSerialNumber(01)",
  "type1": [
    {
      "id": 102101,
      "text": "Did you ask clarifying questions to understand the key metrics and their definitions?"
    },
    {
      "id": 102102,
      "text": "Did you identify the applicable metric categories (acquisition, engagement, monetization, etc.)?"
    },
    {
      "id": 102103,
      "text": "Did you propose specific metrics to track the product's core performance?"
    },
    {
      "id": 102104,
      "text": "Did you discuss any counter-metrics or metrics to monitor potential risks?"
    },
    {
      "id": 102105,
      "text": "Did you relate the metrics back to the key business objectives and user needs?"
    },
    {
      "id": 102106,
      "text": "Did you showcase understanding of metric calculation methodologies?"
    },
    {
      "id": 102107,
      "text": "Did you highlight any data limitations or quality concerns for the proposed metrics?"
    },
    {
      "id": 102108,
      "text": "Did you suggest ways to analyze metric trends over time or across cohorts?"
    },
    {
      "id": 102109,
      "text": "Did you propose a testing strategy to measure the impact of product changes?"
    },
    {
      "id": 102110,
      "text": "Did you discuss any relevant tools or dashboards for metric tracking and analysis?"
    }
  ],
  "type2": [
    {
      "id": 102201,
      "text": "How well did you prioritize the most important metrics for the business?",
      "options": [
        "Did not discuss any metrics prioritization",
        "Discussed prioritization but did not propose a framework",
        "Proposed a basic prioritization framework like AARRR",
        "Proposed a tailored prioritization framework for the product space",
        "Proposed a nuanced, comprehensive prioritization framework linking metrics to business goals"
      ]
    },
    {
      "id": 102202,
      "text": "How insightful was your analysis of metric trends, segments, and cohorts?",
      "options": [
        "Did not discuss any trend or segment analysis",
        "Discussed basic trend analysis but no segmentation",
        "Explored trends across basic segments like demographics",
        "Analyzed trends across relevant user/product segments and cohorts",
        "Provided deep insights by analyzing intersectional trends across multiple meaningful segments"
      ]
    },
    {
      "id": 102203,
      "text": "How solid was your methodology for metric calculation and data quality checks?",
      "options": [
        "Did not discuss any metric calculation methodologies",
        "Mentioned calculation formulas but with flaws or inconsistencies",
        "Outlined metric calculation steps but did not cover data quality",
        "Provided a sound metric calculation methodology with basic data quality checks",
        "Outlined a robust, comprehensive methodology covering calculation, data quality, and limitations"
      ]
    },
    {
      "id": 102204,
      "text": "How effectively did you identify counter-metrics and potential risks?",
      "options": [
        "Did not discuss any counter-metrics or risks",
        "Mentioned 1-2 generic risks without corresponding counter-metrics",
        "Listed some counter-metrics but did not explain their importance",
        "Identified appropriate counter-metrics and explained their significance",
        "Outlined specific risks, insightful counter-metrics, and mitigation strategies"
      ]
    },
    {
      "id": 102205,
      "text": "How well did you tie the metrics strategy to core business/user goals?",
      "options": [
        "Did not relate metrics back to any key goals",
        "Made a surface-level connection between metrics and goals",
        "Aligned some metrics with stated goals but inconsistently",
        "Explicitly mapped all key metrics to core business/user goals",
        "Provided a cohesive metrics strategy fully grounded in core goals"
      ]
    }
  ]
}
