{
  "_id_structure": "1_two_digitFileSerialNumber(03)_questionType(1/2)_twoDigitQuestionSerialNumber(01)",
  "type1": [
    {
      "id": 103101,
      "text": "Did you provide a specific example/situation for each behavioral question?"
    },
    {
      "id": 103102,
      "text": "Did you describe the situation objectively without adding opinions/judgments?"
    },
    {
      "id": 103103,
      "text": "Did you clearly explain the tasks/challenges involved in the situation?"
    },
    {
      "id": 103104,
      "text": "Did you detail the specific actions you took to address the situation?"
    },
    {
      "id": 103105,
      "text": "Did you discuss what you learned or would do differently next time?"
    },
    {
      "id": 103106,
      "text": "Did you relate your example back to the core competency being evaluated?"
    },
    {
      "id": 103107,
      "text": "Did you demonstrate Self-awareness by admitting mistakes/areas of improvement?"
    },
    {
      "id": 103108,
      "text": "Did you showcase teamwork and collaboration in your examples?"
    },
    {
      "id": 103109,
      "text": "Did you highlight your leadership skills through coaching/influencing others?"
    },
    {
      "id": 103110,
      "text": "Did you display problem-solving abilities by describing your thought process?"
    }
  ],
  "type2": [
    {
      "id": 103201,
      "text": "How well did you structure your responses using the STAR format?",
      "options": [
        "Responses were disorganized without a clear structure",
        "Used the STAR format inconsistently or incompletely",
        "Followed STAR format but some points were unclear or missing details",
        "Clearly followed STAR format with appropriate situation details",
        "Perfectly structured using STAR with concise and impactful details"
      ]
    },
    {
      "id": 103202,
      "text": "How effectively did you demonstrate ownership and drive?",
      "options": [
        "Examples did not showcase any initiative or ownership",
        "Mentioned taking ownership but actions were limited",
        "Displayed ownership in a few situations reactively", 
        "Highlighted multiple examples of proactively taking ownership",
        "Provided compelling examples of going above/beyond with exceptional drive"
      ]
    },
    {
      "id": 103203,
      "text": "How well did you handle ambiguity or uncertainty in your examples?",
      "options": [
        "Examples only involved low/no ambiguity situations",
        "Showed struggles with ambiguity without clear approaches",
        "Demonstrated basic approaches like making assumptions in ambiguous cases",
        "Showcased ability to break down and prioritize in ambiguous situations", 
        "Clearly articulated structured frameworks for thriving in highly ambiguous environments"
      ]
    },
    {
      "id": 103204,
      "text": "How strongly did your examples highlight customer/user focus?",
      "options": [
        "Examples did not mention any customer/user perspectives",
        "Mentioned customer/users but actions were company-focused",
        "Displayed some customer/user considerations in approach",
        "Clearly made customer/user needs the key priority",
        "Provided powerful examples of going above and beyond for customer/user"
      ]
    },
    {
      "id": 103205,
      "text": "How persuasively did you demonstrate strategic thinking abilities?",
      "options": [
        "Examples were solely tactical without any strategic insights",
        "Mentioned high-level objectives but did not connect well to approach", 
        "Displayed some strategic thinking inconsistently across examples",
        "Clearly articulated strategic considerations behind actions/decisions",
        "Provided highly strategic examples tying long-term vision to execution"
      ]
    }
  ]
}
