{
  "_id_structure": "1_two_digitFileSerialNumber(04)_questionType(1/2)_twoDigitQuestionSerialNumber(01)",
  "type1": [
    {
      "id": 104101,
      "text": "Did you ask clarifying questions to understand the key requirements and constraints?"
    },
    {
      "id": 104102,
      "text": "Did you propose a high-level system architecture/design before going into details?"
    },
    {
      "id": 104103,
      "text": "Did you identify and discuss the key components/modules of the system?"
    },
    {
      "id": 104104,  
      "text": "Did you consider and address bottlenecks, scalability, and performance concerns?"
    },
    {
      "id": 104105,
      "text": "Did you factor in reliability, availability, and fault-tolerance aspects?"
    },
    {
      "id": 104106,
      "text": "Did you discuss data storage and management requirements/solutions?"
    },
    {
      "id": 104107,
      "text": "Did you touch upon security and privacy considerations where relevant?"
    },
    {
      "id": 104108,
      "text": "Did you explore different tradeoffs and design alternatives objectively?"
    },
    {
      "id": 104109,
      "text": "Did you justify your design choices based on stated requirements and principles?"
    },
    {
      "id": 104110, 
      "text": "Did you discuss potential future enhancements or limitations transparently?"
    }
  ],
  "type2": [
    {
      "id": 104201,
      "text": "How well did you decompose the problem into logical components?",
      "options": [
        "Did not break down the problem into any components/modules",
        "Decomposed the system ad-hoc without a clear approach",
        "Identified key components but missed some important ones",
        "Decomposed the system into appropriate components/layers",
        "Provided a thorough, structured decomposition of all required components"
      ]
    },
    {
      "id": 104202,
      "text": "How effectively did you estimate scale and forecast needs?",  
      "options": [
        "Did not discuss scale or any capacity needs",
        "Made hand-wavy estimates without any calculations",
        "Estimated scale based on some data points but with flaws",
        "Provided reasonable estimations for current and future scale",
        "Outlined a comprehensive calculation of scale and capacity forecasting"
      ]
    },
    {
      "id": 104203,
      "text": "How pragmatically did you evaluate tradeoffs between design choices?",
      "options": [
        "Did not discuss any tradeoffs between different options",
        "Mentioned some tradeoffs but no objective evaluation",
        "Evaluated tradeoffs between a couple of options/dimensions",
        "Objectively discussed key tradeoffs between multiple design choices", 
        "Provided a structured framework to evaluate all key design tradeoffs"
      ]
    },
    {
      "id": 104204,
      "text": "How well did you incorporate principles of scalable system design?",
      "options": [
        "Did not consider scalability or distributed systems concepts",
        "Mentioned some buzzwords like caching, load balancing without depth",
        "Discussed either scalability or distributed principles partially",
        "Incorporated core scalability and distributed systems principles",
        "Seamlessly integrated advanced scalability and systems design patterns"
      ]
    },
    {
      "id": 104205,
      "text": "How crisply did you communicate and sell your system design approach?",
      "options": [
        "Did not articulate the high-level design approach or motivation",
        "High-level messaging was unclear or frequently got lost in details",
        "Communicated the core approach reasonably well with some inconsistencies",
        "Explained the overarching design approach coherently with pros and cons",
        "Delivered a clear, compelling pitch for the chosen system design approach"

     ]
    }
  ]
}